# текст для обробки
text = ("Розробка мови Python була розпочата в кінці 1980-х років співробітником голландського інституту CWI Гвідо ван Россумом. Для розподіленої ОС Amoeba потрібна була розширювана скриптова мова, і Гвідо почав писати Python на дозвіллі, запозичивши деякі напрацювання для мови ABC. У лютому 1991 року мова почала вільно поширюватися через Інтернет і сподобалася іншим програмістам. З 1991 року Python є цілком об'єктно-орієнтованим. Python також запозичив багато рис таких мов, як C, C++, Modula-3 і Icon, й окремі риси функціонального програмування з Ліспу. "
        "Назва мови виникла зовсім не від виду плазунів. Автор назвав мову на честь популярного британського комедійного серіалу 70-х років «Повітряний цирк Монті Пайтона».")
print("Початковий текст:")
print(text)

# Охріменко Валерія
# використано функції title(), split(), replace()

print("\nОхріменко Валерія.")
print("Функція title:")
print(text.title()) # перетворює всі перші літери в тексті на великі
print("Функція split:")
print(text.split()) # розбиває текст на окремі слова
print("Функція replace:")
print(text.replace(" ", "_")) # замінює пробіли на підкреслення

# у програмі необхідно реалізувати:
# 1) swapcase
# 2) count
# 3) upper


# Вакуленко Олександра
# Використано функції swapcase(), count(), upper()

print("\nВакуленко Олександра.")
print("Функція swapcase:")
print(text.swapcase())  # змінює регістр всіх букв на протилежний
print("Функція count (кількість слів 'Python'):")
print(text.count("Python"))  # рахує кількість входжень слова "Python"
print("Функція upper:")
print(text.upper())  # перетворює всі букви на великі

# Наступні 3 функції:
# 1) find() - знайти позицію першого входження підрядка
# 2) isdigit() - перевірити, чи містить рядок цифри
# 3) capitalize() - зробити першу літеру рядка великою
