#Текст для обробки
text = ("Розробка мови Python була розпочата в кінці 1980-х років співробітником голландського інституту CWI Гвідо ван Россумом. Для розподіленої ОС Amoeba потрібна була розширювана скриптова мова, і Гвідо почав писати Python на дозвіллі, запозичивши деякі напрацювання для мови ABC. У лютому 1991 року мова почала вільно поширюватися через Інтернет і сподобалася іншим програмістам. З 1991 року Python є цілком об'єктно-орієнтованим. Python також запозичив багато рис таких мов, як C, C++, Modula-3 і Icon, й окремі риси функціонального програмування з Ліспу. "
        "Назва мови виникла зовсім не від виду плазунів. Автор назвав мову на честь популярного британського комедійного серіалу 70-х років «Повітряний цирк Монті Пайтона».")
print("Початковий текст:")
print(text)

#Охріменко Валерія
#Використано функції title(), split(), replace()

print("\nОхріменко Валерія.")
print("Функція title:")
print(text.title()) #перетворює всі перші літери в тексті на великі
print("Функція split:")
print(text.split()) #розбиває текст на окремі слова
print("Функція replace:")
print(text.replace(" ", "_")) #замінює пробіли на підкреслення

# у програмі необхідно реалізувати:
# 1) зміну регістру всіх букв на протилежний (swapcase);
# 2) порахувати, скільки разів у тексті зустрічається слово "Python" (count)
# 3) перетворити всі букви на великі (upper)


