#завдання: створити словник + реалізувати функцію додавання даних

#структура словника:
# номер групи,
# ПІБ студента,
# курс,
# предмети та оцінки за семестр

students = {
    "Іваненко Роман Андрійович": {
        "група": "КН-31",
        "курс": 2,
        "предмети": {
            "Чисельні методи": [90, 85],
            "Програмування мовою Python": [95, 92],
            "Сучасні парадигми програмування": [78, 85]
        }
    },
    "Шевченко Марія Олександрівна": {
        "група": "КН-31",
        "курс": 2,
        "предмети": {
            "Чисельні методи": [88, 84],
            "Програмування мовою Python": [91, 93],
            "Сучасні парадигми програмування": [95, 92]
        }
    }
}

#список предметів
subjects_list = [
    "Чисельні методи",
    "Програмування мовою Python",
    "Сучасні парадигми програмування"
]

#Охріменко Валерія

#вивід вмісту словника
def print_students():
    print("\nСписок студентів:")
    for name, info in students.items():
        print(f" - {name}:")
        print(f"Група: {info['група']}")
        print(f"Курс: {info['курс']}")
        for subject, marks in info['предмети'].items():
            print(f"{subject}: {marks}")

#додавання нового студента до словника
def add_student():
    full_name = input("Введіть ПІБ студента: ")
    group = input("Введіть номер групи: ")
    course = int(input("Введіть курс: "))

    #запит оцінок для кожного з предметів
    subjects = {}
    for subject in subjects_list:
        marks_input = input(f"Введіть оцінки з '{subject}' через кому: ")
        #перетворюємо введений рядок у список чисел
        marks = list(map(int, marks_input.split(',')))
        subjects[subject] = marks

    #додавання даних про студента до головного словника
    students[full_name] = {
        "група": group,
        "курс": course,
        "предмети": subjects
    }
    print(f"\nНовий студент успішно доданий.")

while True:
    print("\nМеню:")
    print("1. Показати усіх студентів")
    print("2. Додати нового студента")
    print("3. Вихід")

    choice = input("Ваш вибір (1-3): ")

    if choice == "1":
        print_students()
    elif choice == "2":
        add_student()
    elif choice == "3":
        print("Програму завершено.")
        break
    else:
        print("Оберіть дію із меню.")

# у програмі необхідно реалізувати:
# функцію для сортування студентів за середнім балом з предмета, який обере користувач

# також перевірити, чи структура словника є оптимальною, і за потреби змінити
